gcc-mirror/gcc/gcc/config/rl78/rl78.c
static int virt_insn_was_frame;

/* Hook for all insns we emit.  Re-mark them as FRAME_RELATED if
   needed.  */
static rtx
EM2 (int line ATTRIBUTE_UNUSED, rtx r)
{
#if DEBUG_ALLOC
  fprintf (stderr, "\033[36m%d: ", line);
  debug_rtx(r);
  fprintf (stderr, "\033[0m");
#endif
  /*SCHED_GROUP_P (r) = 1;*/
  if (virt_insn_was_frame)
    RTX_FRAME_RELATED_P (r) = 1;
  return r;
}

#define EM(x) EM2 (__LINE__, x)

/* Return a suitable RTX for the low half of a __far address.  */
static rtx
rl78_lo16 (rtx addr)
{
  if (GET_CODE (addr) == SYMBOL_REF
      || GET_CODE (addr) == CONST)
    {
      rtx r = gen_rtx_ZERO_EXTRACT (HImode, addr, GEN_INT (16), GEN_INT (0));
      r = gen_rtx_CONST (HImode, r);
      return r;
    }
  return rl78_subreg (HImode, addr, SImode, 0);
}

/* Return a suitable RTX for the high half's lower byte of a __far address.  */
static rtx
rl78_hi8 (rtx addr)
{
  if (GET_CODE (addr) == SYMBOL_REF
      || GET_CODE (addr) == CONST)
    {
      rtx r = gen_rtx_ZERO_EXTRACT (QImode, addr, GEN_INT (8), GEN_INT (16));
      r = gen_rtx_CONST (QImode, r);
      return r;
    }
  return rl78_subreg (QImode, addr, SImode, 2);
}

/* Copy any register values into real registers and return an RTX for
   the same memory, now addressed by real registers.  Any needed insns
   are emitted before BEFORE.  */
static rtx
transcode_memory_rtx (rtx m, rtx newbase, rtx before)
{
  rtx base, index, addendr;
  int addend = 0;

  if (GET_CODE (m) != MEM)
    return m;

  if (GET_MODE (XEXP (m, 0)) == SImode)
    {
      rtx seg = rl78_hi8 (XEXP (m, 0));
#if DEBUG_ALLOC
      fprintf (stderr, "setting ES:\n");
      debug_rtx(seg);
#endif
      emit_insn_before (EM(gen_movqi (A, seg)), before);
      emit_insn_before (EM(gen_movqi_es (A)), before);
      m = change_address (m, GET_MODE (m), rl78_lo16 (XEXP (m, 0)));
    }

  characterize_address (XEXP (m, 0), &base, &index, &addendr);
  gcc_assert (index == NULL_RTX);

#if DEBUG_ALLOC
  fprintf (stderr, "\033[33m"); debug_rtx(m); fprintf (stderr, "\033[0m");
  debug_rtx (base);
#endif
  if (base == NULL_RTX)
    return m;

  if (addendr && GET_CODE (addendr) == CONST_INT)
    addend = INTVAL (addendr);

  if (REGNO (base) == SP_REG)
    {
      if (addend >= 0 && addend  <= 255)
	return m;
    }

  /* BASE should be a virtual register.  We copy it to NEWBASE.  If
     the addend is out of range for DE/HL, we use AX to compute the full
     address.  */

  if (addend < 0
      || (addend > 255 && REGNO (newbase) != 2)
      || (addendr && GET_CODE (addendr) != CONST_INT))
    {
      /* mov ax, vreg
	 add ax, #imm
	 mov hl, ax	*/
      EM (emit_insn_before (gen_movhi (AX, base), before));
      EM (emit_insn_before (gen_addhi3 (AX, AX, addendr), before));
      EM (emit_insn_before (gen_movhi (newbase, AX), before));
      base = newbase;
      addend = 0;
    }
  else
    {
      EM (emit_insn_before (gen_movhi (newbase, base), before));
      base = newbase;
    }

  if (addend)
    base = gen_rtx_PLUS (HImode, base, GEN_INT (addend));

#if DEBUG_ALLOC
  fprintf (stderr, "\033[33m");
  debug_rtx (m);
#endif
  m = change_address (m, GET_MODE (m), base);
#if DEBUG_ALLOC
  debug_rtx (m);
  fprintf (stderr, "\033[0m");
#endif
  return m;
}

/* Copy SRC to accumulator (A or AX), placing any generated insns
   before BEFORE.  Returns accumulator RTX.  */

static rtx
move_to_acc (int opno, rtx before)
{
  rtx src = OP(opno);
  enum machine_mode mode = GET_MODE (src);

  if (GET_CODE (src) == REG
      && REGNO (src) < 2)
    return src;

  if (mode == VOIDmode)
    mode = recog_data.operand_mode[opno];

  if (mode == QImode)
    {
      EM (emit_insn_before (gen_movqi (A, src), before));
      return A;
    }
  else
    {
      EM (emit_insn_before (gen_movhi (AX, src), before));
      return AX;
    }
}

/* Copy accumulator (A or AX) to DEST, placing any generated insns
   after AFTER.  Returns accumulator RTX.  */

static rtx
move_from_acc (rtx dest, rtx after)
{
  enum machine_mode mode = GET_MODE (dest);

  if (REG_P (dest) && REGNO (dest) < 2)
    return dest;

  if (mode == QImode)
    {
      EM (emit_insn_after (gen_movqi (dest, A), after));
      return A;
    }
  else
    {
      EM (emit_insn_after (gen_movhi (dest, AX), after));
      return AX;
    }
}

/* Copy accumulator (A or AX) to REGNO, placing any generated insns
   before BEFORE.  Returns reg RTX.  */

static rtx
move_acc_to_reg (rtx acc, int regno, rtx before)
{
  enum machine_mode mode = GET_MODE (acc);
  rtx reg;

  reg = gen_rtx_REG (mode, regno);

  if (mode == QImode)
    {
      EM (emit_insn_before (gen_movqi (reg, A), before));
      return reg;
    }
  else
    {
      EM (emit_insn_before (gen_movhi (reg, AX), before));
      return reg;
    }
}

/* Copy SRC to X, placing any generated insns before BEFORE.
   Returns X RTX.  */

static rtx
move_to_x (int opno, rtx before)
{
  rtx src = OP(opno);
  enum machine_mode mode = GET_MODE (src);
  rtx reg;

  if (mode == VOIDmode)
    mode = recog_data.operand_mode[opno];
  reg = (mode == QImode) ? X : AX;

  if (mode == QImode || ! is_virtual_register (OP (opno)))
    {
      OP(opno) = move_to_acc (opno, before);
      OP(opno) = move_acc_to_reg (OP(opno), X_REG, before);
      return reg;
    }

  if (mode == QImode)
    EM (emit_insn_before (gen_movqi (reg, src), before));
  else
    EM (emit_insn_before (gen_movhi (reg, src), before));

  return reg;
}

/* Copy OP(opno) to H or HL, placing any generated insns before BEFORE.
   Returns H/HL RTX.  */

static rtx
move_to_hl (int opno, rtx before)
{
  rtx src = OP (opno);
  enum machine_mode mode = GET_MODE (src);
  rtx reg;

  if (mode == VOIDmode)
    mode = recog_data.operand_mode[opno];
  reg = (mode == QImode) ? L : HL;

  if (mode == QImode || ! is_virtual_register (OP (opno)))
    {
      OP (opno) = move_to_acc (opno, before);
      OP (opno) = move_acc_to_reg (OP (opno), L_REG, before);
      return reg;
    }

  if (mode == QImode)
    EM (emit_insn_before (gen_movqi (reg, src), before));
  else
    EM (emit_insn_before (gen_movhi (reg, src), before));

  return reg;
}

/* Copy OP(opno) to E or DE, placing any generated insns before BEFORE.
   Returns E/DE RTX.  */

static rtx
move_to_de (int opno, rtx before)
{
  rtx src = OP (opno);
  enum machine_mode mode = GET_MODE (src);
  rtx reg;

  if (mode == VOIDmode)
    mode = recog_data.operand_mode[opno];

  reg = (mode == QImode) ? E : DE;

  if (mode == QImode || ! is_virtual_register (OP (opno)))
    {
      OP (opno) = move_to_acc (opno, before);
      OP (opno) = move_acc_to_reg (OP (opno), E_REG, before);
    }
  else
    {
      rtx move = mode == QImode ? gen_movqi (reg, src) : gen_movhi (reg, src);

