gcc-mirror/gcc/gcc/config/rl78/rl78.c
      EM (emit_insn_before (move, before));
    }

  return reg;
}

/* Devirtualize an insn of the form (SET (op) (unop (op))).  */
static void
rl78_alloc_physical_registers_op1 (rtx insn)
{
  /* op[0] = func op[1] */

  /* We first try using A as the destination, then copying it
     back.  */
  if (rtx_equal_p (OP(0), OP(1)))
    {
      OP(0) =
      OP(1) = transcode_memory_rtx (OP(1), DE, insn);
    }
  else
    {
      OP(0) = transcode_memory_rtx (OP(0), BC, insn);
      OP(1) = transcode_memory_rtx (OP(1), HL, insn);
    }

  MAYBE_OK (insn);

  OP(0) = move_from_acc (OP(0), insn);

  MAYBE_OK (insn);

  /* Try copying the src to acc first, then.  This is for, for
     example, ZERO_EXTEND or NOT.  */
  OP(1) = move_to_acc (1, insn);

  MAYBE_OK (insn);

  FAILED;
}

/* Devirtualize an insn of the form (SET (op) (unop (op) (op))).  */
static void
rl78_alloc_physical_registers_op2 (rtx insn)
{
  /* op[0] = op[1] func op[2] */
  rtx prev = prev_nonnote_nondebug_insn (insn);
  rtx first;
  bool hl_used;

  if (rtx_equal_p (OP(0), OP(1)))
    {
      OP(0) =
      OP(1) = transcode_memory_rtx (OP(1), DE, insn);
      prev = next_nonnote_nondebug_insn (prev);
      OP(2) = transcode_memory_rtx (OP(2), HL, insn);
      prev = prev_nonnote_nondebug_insn (prev);
    }
  else if (rtx_equal_p (OP(0), OP(2)))
    {
      OP(1) = transcode_memory_rtx (OP(1), DE, insn);
      prev = next_nonnote_nondebug_insn (prev);
      OP(0) =
      OP(2) = transcode_memory_rtx (OP(2), HL, insn);
      prev = prev_nonnote_nondebug_insn (prev);
    }
  else
    {
      OP(0) = transcode_memory_rtx (OP(0), BC, insn);
      OP(1) = transcode_memory_rtx (OP(1), DE, insn);
      prev = next_nonnote_nondebug_insn (prev);
      OP(2) = transcode_memory_rtx (OP(2), HL, insn);
    }

  MAYBE_OK (insn);

  prev = prev_nonnote_nondebug_insn (insn);
  if (recog_data.constraints[1][0] == '%'
      && is_virtual_register (OP (1))
      && ! is_virtual_register (OP (2))
      && ! CONSTANT_P (OP (2)))
    {
      rtx tmp = OP (1);
      OP (1) = OP (2);
      OP (2) = tmp;
    }

  /* Make a note of wether (H)L is being used.  It matters
     because if OP(2) alsoneeds reloading, then we must take
     care not to corrupt HL.  */
  hl_used = reg_mentioned_p (L, OP (0)) || reg_mentioned_p (L, OP (1));

  OP(0) = move_from_acc (OP (0), insn);
  OP(1) = move_to_acc (1, insn);

  MAYBE_OK (insn);

  /* We have to copy op2 to HL, but that involves AX, which
     already has a live value.  Emit it before those insns.  */

  if (prev)
    first = next_nonnote_nondebug_insn (prev);
  else
    for (first = insn; prev_nonnote_nondebug_insn (first); first = prev_nonnote_nondebug_insn (first))
      ;

  OP (2) = hl_used ? move_to_de (2, first) : move_to_hl (2, first);
  
  MAYBE_OK (insn);
  
  FAILED;
}

/* Devirtualize an insn of the form (SET () (unop (op))).  */

static void
rl78_alloc_physical_registers_ro1 (rtx insn)
{
  /* (void) op[0] */
  OP(0) = transcode_memory_rtx (OP(0), BC, insn);

  MAYBE_OK (insn);

  OP(0) = move_to_acc (0, insn);

  MAYBE_OK (insn);

  FAILED;
}

/* Devirtualize a compare insn.  */
static void
rl78_alloc_physical_registers_cmp (rtx insn)
{
  /* op[1] cmp_op[0] op[2] */
  rtx prev = prev_nonnote_nondebug_insn (insn);
  rtx first;

  OP(1) = transcode_memory_rtx (OP(1), DE, insn);
  OP(2) = transcode_memory_rtx (OP(2), HL, insn);

  MAYBE_OK (insn);

  OP(1) = move_to_acc (1, insn);

  MAYBE_OK (insn);

  /* We have to copy op2 to HL, but that involves the acc, which
     already has a live value.  Emit it before those insns.  */

  if (prev)
    first = next_nonnote_nondebug_insn (prev);
  else
    for (first = insn; prev_nonnote_nondebug_insn (first); first = prev_nonnote_nondebug_insn (first))
      ;
  OP(2) = move_to_hl (2, first);

  MAYBE_OK (insn);

  FAILED;
}

/* Like op2, but AX = A op X.  */
static void
rl78_alloc_physical_registers_umul (rtx insn)
{
  /* op[0] = op[1] func op[2] */
  rtx prev = prev_nonnote_nondebug_insn (insn);
  rtx first;

  OP(0) = transcode_memory_rtx (OP(0), BC, insn);
  OP(1) = transcode_memory_rtx (OP(1), DE, insn);
  OP(2) = transcode_memory_rtx (OP(2), HL, insn);

  MAYBE_OK (insn);

  if (recog_data.constraints[1][0] == '%'
      && is_virtual_register (OP(1))
      && !is_virtual_register (OP(2))
      && !CONSTANT_P (OP(2)))
    {
      rtx tmp = OP(1);
      OP(1) = OP(2);
      OP(2) = tmp;
    }

  OP(0) = move_from_acc (OP(0), insn);
  OP(1) = move_to_acc (1, insn);

  MAYBE_OK (insn);

  /* We have to copy op2 to X, but that involves the acc, which
     already has a live value.  Emit it before those insns.  */

  if (prev)
    first = next_nonnote_nondebug_insn (prev);
  else
    for (first = insn; prev_nonnote_nondebug_insn (first); first = prev_nonnote_nondebug_insn (first))
      ;
  OP(2) = move_to_x (2, first);

  MAYBE_OK (insn);

  FAILED;
}

/* Scan all insns and devirtualize them.  */
static void
rl78_alloc_physical_registers (void)
{
  /* During most of the compile, gcc is dealing with virtual
     registers.  At this point, we need to assign physical registers
     to the vitual ones, and copy in/out as needed.  */

  rtx insn, curr;
  enum attr_valloc valloc_method;

  for (insn = get_insns (); insn; insn = curr)
    {
      int i;

      curr = next_nonnote_nondebug_insn (insn);

      if (INSN_P (insn)
	  && (GET_CODE (PATTERN (insn)) == SET
	      || GET_CODE (PATTERN (insn)) == CALL)
	  && INSN_CODE (insn) == -1)
	{
	  if (GET_CODE (SET_SRC (PATTERN (insn))) == ASM_OPERANDS)
	    continue;
	  i = recog (PATTERN (insn), insn, 0);
	  if (i == -1)
	    {
	      debug_rtx (insn);
	      gcc_unreachable ();
	    }
	  INSN_CODE (insn) = i;
	}
    }

  cfun->machine->virt_insns_ok = 0;
  cfun->machine->real_insns_ok = 1;

  for (insn = get_insns (); insn; insn = curr)
    {
      curr = insn ? next_nonnote_nondebug_insn (insn) : NULL;

      if (!INSN_P (insn))
	continue;
      if (GET_CODE (PATTERN (insn)) != SET
	  && GET_CODE (PATTERN (insn)) != CALL)
	  continue;

      if (GET_CODE (SET_SRC (PATTERN (insn))) == ASM_OPERANDS)
	continue;

      valloc_method = get_attr_valloc (insn);

