gcc-mirror/gcc/gcc/config/rl78/rl78.c
	      if (GET_CODE (dest) == REG)
		{
		  int dr = REGNO (dest);

		  if (GET_CODE (src) == REG)
		    {
		      int sr = REGNO (src);
		      int same = 1;
		      int best_age, best_reg;

		      /* See if the copy is not needed.  */
		      for (i = 0; i < mb; i ++)
			if (origins[dr + i] != origins[sr + i])
			  same = 0;
		      if (same)
			{
			  if (dump_file)
			    fprintf (dump_file, "deleting because dest already has correct value\n");
			  delete_insn (insn);
			  break;
			}

		      if (dr < 8 || sr >= 8)
			{
			  int ar;

			  best_age = -1;
			  best_reg = -1;
			  /* See if the copy can be made from another
			     bank 0 register instead, instead of the
			     virtual src register.  */
			  for (ar = 0; ar < 8; ar += mb)
			    {
			      same = 1;
			      for (i = 0; i < mb; i ++)
				if (origins[ar + i] != origins[sr + i])
				  same = 0;

			      /* The chip has some reg-reg move limitations.  */
			      if (mb == 1 && dr > 3)
				same = 0;

			      if (same)
				{
				  if (best_age == -1 || best_age > age[sr + i])
				    {
				      best_age = age[sr + i];
				      best_reg = sr;
				    }
				}
			    }

			  if (best_reg != -1)
			    {
			      /* FIXME: copy debug info too.  */
			      SET_SRC (pat) = gen_rtx_REG (GET_MODE (src), best_reg);
			      sr = best_reg;
			    }
			}

		      for (i = 0; i < mb; i++)
			{
			  origins[dr + i] = origins[sr + i];
			  age[dr + i] = age[sr + i] + 1;
			}
		    }
		  else
		    {
		      /* The destination is computed, its origin is itself.  */
		      if (dump_file)
			fprintf (dump_file, "resetting origin of r%d for %d byte%s\n",
				 dr, mb, mb == 1 ? "" : "s");
		      for (i = 0; i < mb; i ++)
			{
			  origins[dr + i] = dr + i;
			  age[dr + i] = 0;
			}
		    }

		  /* Any registers marked with that reg as an origin are reset.  */
		  for (i = 0; i < FIRST_PSEUDO_REGISTER; i++)
		    if (origins[i] >= dr && origins[i] < dr + mb)
		      {
			origins[i] = i;
			age[i] = 0;
		      }
		}

	      /* Special case - our ADDSI3 macro uses AX */
	      if (get_attr_valloc (insn) == VALLOC_MACAX)
		{
		  if (dump_file)
		    fprintf (dump_file, "Resetting origin of AX for macro.\n");
		  for (i = 0; i < FIRST_PSEUDO_REGISTER; i++)
		    if (i <= 1 || origins[i] <= 1)
		      {
			origins[i] = i;
			age[i] = 0;
		      }
		}

	      if (GET_CODE (src) == ASHIFT
		  || GET_CODE (src) == ASHIFTRT
		  || GET_CODE (src) == LSHIFTRT)
		{
		  rtx count = XEXP (src, 1);
		  if (GET_CODE (count) == REG)
		    {
		      /* Special case - our pattern clobbers the count register.  */
		      int r = REGNO (count);
		      if (dump_file)
			fprintf (dump_file, "Resetting origin of r%d for shift.\n", r);
		      for (i = 0; i < FIRST_PSEUDO_REGISTER; i++)
			if (i == r || origins[i] == r)
			  {
			    origins[i] = i;
			    age[i] = 0;
			  }
		    }
		}
	    }
	}
    }
}

/* Remove any SETs where the destination is unneeded.  */
static void
rl78_remove_unused_sets (void)
{
  rtx insn, ninsn = NULL_RTX;
  rtx dest;

  for (insn = get_insns (); insn; insn = ninsn)
    {
      ninsn = next_nonnote_nondebug_insn (insn);

      if ((insn = single_set (insn)) == NULL_RTX)
	continue;

      dest = SET_DEST (insn);

      if (REGNO (dest) > 23)
	continue;

      if (find_regno_note (insn, REG_UNUSED, REGNO (dest)))
	delete_insn (insn);
    }
}

#undef  xTARGET_MACHINE_DEPENDENT_REORG
#define xTARGET_MACHINE_DEPENDENT_REORG  rl78_reorg

/* This is the top of the devritualization pass.  */
static void
rl78_reorg (void)
{
  rl78_alloc_physical_registers ();

  if (dump_file)
    {
      fprintf (dump_file, "\n================DEVIRT:=AFTER=ALLOC=PHYSICAL=REGISTERS================\n");
      print_rtl_with_bb (dump_file, get_insns (), 0);
    }

  rl78_propogate_register_origins ();
  rl78_calculate_death_notes ();

  if (dump_file)
    {
      fprintf (dump_file, "\n================DEVIRT:=AFTER=PROPOGATION=============================\n");
      print_rtl_with_bb (dump_file, get_insns (), 0);
      fprintf (dump_file, "\n======================================================================\n");
    }

  rl78_remove_unused_sets ();

  /* The code after devirtualizing has changed so much that at this point
     we might as well just rescan everything.  Note that
     df_rescan_all_insns is not going to help here because it does not
     touch the artificial uses and defs.  */
  df_finish_pass (true);
  if (optimize > 1)
    df_live_add_problem ();
  df_scan_alloc (NULL);
  df_scan_blocks ();

  if (optimize)
    df_analyze ();
}

#undef TARGET_RETURN_IN_MEMORY
#define TARGET_RETURN_IN_MEMORY rl78_return_in_memory

static bool
rl78_return_in_memory (const_tree type, const_tree fntype ATTRIBUTE_UNUSED)
{
  const HOST_WIDE_INT size = int_size_in_bytes (type);
  return (size == -1 || size > 8);
}


struct gcc_target targetm = TARGET_INITIALIZER;

#include "gt-rl78.h"
